// Написать программу вычисления значения функции y = f(a)
// Допустим f(a)= a -2 *3
Console.Write("введите значение переменной а - ");
int a = Convert.ToInt32(Console.ReadLine());
int y = 0;

y = a - 2 * 3;

Console.WriteLine("y = " + y);

